Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: There is one catch: If one of the .cpp files does not contain the word "GetResp", you will get an error and replacing will stop. To avoid this, add the "e" flag to the substitute command: >
es_es: Hay un pequeño problema: Si uno de los archivos .cpp no contiene la palabra «GetResp», obtendrá un error y la ejecución se detendrá. Para evitar esto, añada la opción «e» a la orden de sustituir: >

source: *12.2* Change "Last, First" to "First Last"
es_es: *12.2* Cambiar «Último, Primero» a «Primero Último»

source: Doe, John ~ Smith, Peter ~
es_es: Pepe, Juan ~ Amancio, Pedro ~

source: John Doe ~ Peter Smith ~
es_es: Juan Pepe ~ Pedro Amancio ~

source: Let's break this down in parts. Obviously it starts with a substitute command. The "%" is the line range, which stands for the whole file. Thus the substitution is done in every line in the file. The arguments for the substitute command are "/from/to/". The slashes separate the "from" pattern and the "to" string. This is what the "from" pattern contains: \([^,]*\), \(.*\) ~
es_es: Veámoslo por partes. Obviamente comienza con la orden «substitute». El «%» es el rango de líneas, que se refiere al archivo completo. Por lo tanto la sustitución se producirá en cada línea del archivo. Los argumentos para la orden sustituir son «/desde/a/». Las barras separan el patrón «desde» y la cadena "hacia". Esto es lo que el patrón «desde» contiene: \([^,]*\), \(.*\) ~

source: The first part between \( \) matches "Last" \( \) match anything but a comma [^,] any number of times * matches ", " literally , The second part between \( \) matches "First" \( \) any character . any number of times *
es_es: La primera parte entre \( \) concuerda «Último» \( \) concordar cualquier cosa excepto una coma [^,] cualquier número de veces * concuerda literalmente ", " , La segunda parte entre \( \) concuerda «Primero» \( \) cualquier carácter . cualquier número de veces *

source: In the "to" part we have "\2" and "\1". These are called backreferences. They refer to the text matched by the "\( \)" parts in the pattern. "\2" refers to the text matched by the second "\( \)", which is the "First" name. "\1" refers to the first "\( \)", which is the "Last" name. You can use up to nine backreferences in the "to" part of a substitute command. "\0" stands for the whole matched pattern. There are a few more special items in a substitute command, see |sub-replace-special|.
es_es: En la parte «a» tenemos «\2» y «\1». A esto se le llaman referencias «inversas». Se refieren al texto encontrado por los «\( \)» del patrón. «\2» se refiere al texto del segundo «\( \)», que es el nombre «Primero». «\1» se refiere al primer «\( \)», que es el nombre «Último». Puede usar hasta nueve referencias «inversas» en la parte «a» de una orden de sustitución. «\0x se refiere a la cadena coincidente completa. Hay otros elementos especiales en una orden sustituir, consulte |sub-replace-special|.

source: *12.3* Sort a list
es_es: *12.3* Ordenar una lista

source: In a Makefile you often have a list of files. For example:
es_es: A menudo, en un archivo Makefile tiene una lista de archivos. Por ejemplo:

source: This goes to the first line, where "OBJS" is the first thing in the line. Then it goes one line down and filters the lines until the next empty line. You could also select the lines in Visual mode and then use "!sort". That's easier to type, but more work when there are many lines. The result is this:
es_es: Esto va a la primera línea, donde «OBJS» es lo primero que se encuentra en una línea. Luego baja una línea y filtra las líneas hasta encontrar una línea vacía. También podría seleccionar las líneas en modo Visual y escribir «!sort». Es más fácil pero conlleva más trabajo cuando hay muchas líneas. El resultado es el siguiente:

source: Notice that a backslash at the end of each line is used to indicate the line continues. After sorting, this is wrong! The "backup.o" line that was at the end didn't have a backslash. Now that it sorts to another place, it must have a backslash. The simplest solution is to add the backslash with "A \<Esc>". You can keep the backslash in the last line, if you make sure an empty line comes after it. That way you don't have this problem again.
es_es: Observe que una barra inversa al final de cada línea se usa para indicar que la línea continúa. Tras ordenar, está mal puesto. La línea de «backup.o» que estaba al final no tenía una barra inversa. Ahora que se sitúa en otro lugar debe tener una barra inversa. La solución más sencilla es añadirla con «A \<Esc>». Puede mantener la barra en la última línea si se asegura de que una línea en blanco viene justo después. De este modo no tendrá este problema de nuevo.

source: *12.4* Reverse line order
es_es: *12.4* Invertir el orden de las líneas

source: The |:global| command can be combined with the |:move| command to move all the lines before the first line, resulting in a reversed file. The command is: >
es_es: La orden «|:global|» se debe combinar con la orden «|:move|» para mover todas las líneas antes de la primera línea, invirtiendo el archivo. La orden es: >

source: The "^" regular expression matches the beginning of the line (even if the line is blank). The |:move| command moves the matching line to after the mythical zeroth line, so the current matching line becomes the first line of the file. As the |:global| command is not confused by the changing line numbering, |:global| proceeds to match all remaining lines of the file and puts each as the first.
es_es: La expresión regular «^» coincide con el comienzo de línea (incluso si la línea está en blanco). La orden «|:move|» mueve la línea justo después de la mítica «línea cero», de forma que se convierte en la primera línea. Como la orden «|:global|» no se confunde al cambiar la numeración de las líneas, «|:global|» procede a concordar el resto de líneas del archivo y pone cada una como la primera.

source: This also works on a range of lines. First move to above the first line and mark it with "mt". Then move the cursor to the last line in the range and type: >
es_es: Esto también funciona sobre un rango de líneas. Vaya primero a la línea de encima de la primera y márcala con "mt". Luego pon el cursor en la última línea del rango y escribe: >

source: *12.5* Count words
es_es: *12.5* Contar palabras

source: Sometimes you have to write a text with a maximum number of words. Vim can count the words for you. When the whole file is what you want to count the words in, use this command: >
es_es: A veces puede escribir un texto con un número máximo de palabras. Vim puede contar las palabras por Ud. Cuando quiera usar el archivo completo para contar las palabras, use la siguiente orden: >

source: Do not type a space after the g, this is just used here to make the command easy to read. The output looks like this:
es_es: No teclee un espacio tras la «g», esto está aquí para hacer que la orden sea fácil de leer. La salida tendrá este aspecto:

source: Col 1 of 0; Line 141 of 157; Word 748 of 774; Byte 4489 of 4976 ~
es_es: Col 1 of 0; Línea 141 of 157; Palabra 748 of 774; Carácter 4489 of 4976 ~

source: When the text is only part of a file, you could move to the start of the text, type "g CTRL-G", move to the end of the text, type "g CTRL-G" again, and then use your brain to compute the difference in the word position. That's a good exercise, but there is an easier way. With Visual mode, select the text you want to count words in. Then type g CTRL-G. The result:
es_es: Cuando el texto sea sólo una parte del archivo, puede ir al comienzo del texto, pulsar «g CTRL-G», ir al final del texto y volver a escribir «g CTRL-G» y usar la cabeza para calcular la diferencia. Es un buen ejercicio, pero hay un modo más sencillo. En el modo Visual, seleccione el texto sobre el que quiera contar las palabras. Escriba «g CTRL-G». El resultado será:

source: Selected 5 of 293 Lines; 70 of 1884 Words; 359 of 10928 Bytes ~
es_es: Selección 5 of 293 Líneas; 70 of 1884 Palabras; 359 of 10928 Bytes ~

source: *12.6* Find a man page *find-manpage*
es_es: *12.6* Encontrar una página de manual *find-manpage*

source: Vim will run the external "man" program on the word. If the man page is found, it is displayed. This uses the normal pager to scroll through the text (mostly the "more" program). When you get to the end pressing <Enter> will get you back into Vim.
es_es: Vim ejecutará el programa externo «man» sobre la palabra. Si se encuentra la página de manual, se mostrará. Esto usa el paginador normal para desplazarse por el texto (con el programa «more»). Cuando llegue al final, presionando <Intro> le devolverá a Vim.

source: A disadvantage is that you can't see the man page and the text you are working on at the same time. There is a trick to make the man page appear in a Vim window. First, load the man filetype plugin: >
es_es: Una desventaja es que no puede ver la página de manual y el texto en el que trabaja al mismo tiempo. Hay un truco para hacer que la página de manual aparezca en una ventana de Vim. Primero cargue la extensión del tipo de archivo man: >

source: Put this command in your vimrc file if you intend to do this often. Now you can use the ":Man" command to open a window on a man page: >
es_es: Ponga esta orden en su archivo «vimrc» si tiene la intención de hacer esto a menudo. Ahora puede usar «:Man» para ver una página man en una ventana: >

source: You can scroll around and the text is highlighted. This allows you to find the help you were looking for. Use CTRL-W w to jump to the window with the text you were working on. To find a man page in a specific section, put the section number first. For example, to look in section 3 for "echo": >
es_es: Puede desplazarse alrededor y el texto se resaltará. Esto le permite encontrar la ayuda que estaba buscando. Use «CTRL-W w» para saltar a la ventana con el texto en el que trabajaba. Para encontrar la página de manual en una sección específica, ponga el número de sección primero. Por ejemplo, para ver «echo» en la sección 3: >

source: To jump to another man page, which is in the text with the typical form "word(1)", press CTRL-] on it. Further ":Man" commands will use the same window.
es_es: Para saltar a otra página de manual, la cuál está en el texto con la forma típica «word(1)», pulse «CTRL-]» sobre ella. Otras llamadas a «:Man» emplearán la misma ventana.

source: (If you redefined the <Leader>, use it instead of the backslash). For example, you want to know the return value of "strstr()" while editing this line:
es_es: (Si ha redefinido <Leader>, úselo en lugar de la barra inversa). Por ejemplo, puede que quiera saber el valor que le devuelve «strstr()» mientras edita esta línea:

source: Move the cursor to somewhere on "strstr" and type "\K". A window will open to display the man page for strstr().
es_es: Ponga el cursor en alguna parte de «strstr» y escriba «\K». Una ventana se abrirá a continuación para mostrar la página de manual de «strstr()».

source: *12.7* Trim blanks
es_es: *12.7* Eliminar espacios en blanco sobrantes

source: Some people find spaces and tabs at the end of a line useless, wasteful, and ugly. To remove whitespace at the end of every line, execute the following command: >
es_es: Algunas personas encuentran los espacios y los tabuladores al final de línea inútiles y feos. Para eliminar el espacio en blanco al final de cada línea, ejecute la siguiente orden: >

source: The line range "%" is used, thus this works on the whole file. The pattern that the ":substitute" command matches with is "\s\+$". This finds white space characters (\s), 1 or more of them (\+), before the end-of-line ($). Later will be explained how you write patterns like this |usr_27.txt|. The "to" part of the substitute command is empty: "//". Thus it replaces with nothing, effectively deleting the matched white space.
es_es: El rango de línea «%» es empleado, funcionando sobre todo en el archivo completo. El patrón que la orden «:substitute» concuerda es el «\s\+$». Esto encuentra los caracteres en blanco (\s), 1 o más (\+), antes del final de línea ($). Más tarde explicaremos cómo se escriben patrones como este |usr_27.txt|. La parte «hacia» de la orden de sustituxión está vacía: «//». Por lo tanto reemplaza con nada, lo que de hecho elimina el espacio en blanco.

source: Another wasteful use of spaces is placing them before a tab. Often these can be deleted without changing the amount of white space. But not always! Therefore, you can best do this manually. Use this search command: >
es_es: Otro uso desafortunado de los espacios es colocarlos antes de un tabulador. A menudo, se pueden eliminar sin cambiar la cantidad de espacio en blanco. ¡Pero no siempre! Por lo tanto, lo mejor es que lo haga a mano. Use esta orden de búsqueda: >

source: You cannot see it, but there is a space before a tab in this command. Thus it's "/<Space><Tab>". Now use "x" to delete the space and check that the amount of white space doesn't change. You might have to insert a tab if it does change. Type "n" to find the next match. Repeat this until no more matches can be found.
es_es: No puede verlo, pero hay un espacio antes de un tabulador en esta orden. De hecho, es «/<Espacio><Tabulador>». Use ahora «x» para eliminar el espacio y comprobar que la cantidad de espacio en blanco no cambia. Puede que tenga que insertar un tabulador si cambia. Teclee «n» para encontrar la próxima coincidencia. Repita esto hasta que no se encuentren más concordancias.

source: *12.8* Find where a word is used
es_es: *12.8* Buscar donde se emplea una palabra

source: If you are a UNIX user, you can use a combination of Vim and the grep command to edit all the files that contain a given word. This is extremely useful if you are working on a program and want to view or edit all the files that contain a specific variable. For example, suppose you want to edit all the C program files that contain the word "frame_counter". To do this you use the command: >
es_es: Si eres un usuario de sistemas UNIX, puede usar una combinación de Vim y «grep» para editar todos los archivos que contengan la palabra dada. Esto es extremadamente útil si está trabajando en un programa y quiere ver o editar todos los archivos que contienen una variable específica. Por ejemplo, suponga que desea editar todos los archivos C que contengan la palabra «frame_counter». Para hacer esto, use la orden: >

source: The above command only finds the files in which the word is found. You still have to find the word within the files. Vim has a built-in command that you can use to search a set of files for a given string. If you want to find all occurrences of "error_string" in all C program files, for example, enter the following command: >
es_es: La orden anterior sólo dice los archivos en los cuáles se encuentra la palabra. Todavía tendrás que encontrar la palabra entre los archivos. Vim tiene una orden integrada que puede usar para buscar una cadena en un conjunto de archivos. Si desea encontrar todas las coincidencias de «error_string» en todos los archivos C, por ejemplo, introduzca lo siguiente: >

source: This causes Vim to search for the string "error_string" in all the specified files (*.c). The editor will now open the first file where a match is found and position the cursor on the first matching line. To go to the next matching line (no matter in what file it is), use the ":cnext" command. To go to the previous match, use the ":cprev" command. Use ":clist" to see all the matches and where they are. The ":grep" command uses the external commands grep (on Unix) or findstr (on Windows). You can change this by setting the option 'grepprg'.
es_es: Esto hace que Vim busque la cadena «error_string» en cada uno de los archivos especificados (*.c). El editor abrirá el primer archivo donde se produzca una concordancia y posicionará el cursor en la primera línea coincidente. Para ir a la siguiente línea (no importa en que archivo se encuentre), use la orden «:cnext». Para ir a la anterior, use «:cprev». Use «:clist» para ver todas las coincidencias y dónde están. La orden «:grep"» usa la orden externa «grep» en Unix y «findstr» en Windows. Puedes cambiar esto modificando la opción 'grepprg'.

source: *usr_04.txt* For Vim version 7.3. Last change: 2008 Sep 06
es_es: *usr_04.esx* Para Vim versión 7.3. Último cambio: 7/6/2008

source: Making small changes
es_es: Hacer cambios pequeños

source: This chapter shows you several ways of making corrections and moving text around. It teaches you the three basic ways to change text: operator-motion, Visual mode and text objects.
es_es: Este capítulo le muestra diferentes formas de hacer correcciones y moverse en el texto. Le muestra los tres modos básicos de cambiar texto: operador-movimiento, modo Visual y objetos de texto.

source: |04.1| Operators and motions |04.2| Changing text |04.3| Repeating a change |04.4| Visual mode |04.5| Moving text |04.6| Copying text |04.7| Using the clipboard |04.8| Text objects |04.9| Replace mode |04.10| Conclusion
es_es: |04.1| Operadores y movimiento |04.2| Cambiar texto |04.3| Repetir un cambio |04.4| Modo Visual |04.5| Mover texto |04.6| Copiar texto |04.7| Uso del portapapeles |04.8| Objetos de texto |04.9| Modo reemplazar |04.10| Conclusión

source: Next chapter: |usr_05.txt| Set your settings Previous chapter: |usr_03.txt| Moving around Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_05.esx| Configuración Capítulo anterior: |usr_03.esx| Desplazamiento Tabla de contenidos: |usr_toc.esx|

source: *04.1* Operators and motions
es_es: *04.1* Operadores y movimiento

source: In chapter 2 you learned the "x" command to delete a single character. And using a count: "4x" deletes four characters. The "dw" command deletes a word. You may recognize the "w" command as the move word command. In fact, the "d" command may be followed by any motion command, and it deletes from the current location to the place where the cursor winds up. The "4w" command, for example, moves the cursor over four words. The d4w command deletes four words.
es_es: En el capítulo 2 aprendió que la orden «x» elimina un único carácter. Y que usar un multiplicador: «4x» elimina cuatro caracteres. La orden «dw» elimina una palabra. Reconocerá la orden «w» como el de movimiento sobre palabras. De hecho, la orden «d» se ha completar con una orden de movimiento, y elimina desde la posición actual hasta donde marque el movimiento. La orden «4w», por ejemplo, mueve el cursor cuatro palabras. La orden d4w elimina cuatro palabras.

source: To err is human. To really foul up you need a computer. ~ ------------------> d4w
es_es: Errar es humano. Para liarla de verdad necesitas un ordenador. ~ ----------------------> d4w

source: Vim only deletes up to the position where the motion takes the cursor. That's because Vim knows that you probably don't want to delete the first character of a word. If you use the "e" command to move to the end of a word, Vim guesses that you do want to include that last character:
es_es: Vim sólo elimina hasta la posición donde la orden de movimiento le lleva. Eso es porque Vim sabe que probablemente no desea eliminar la primera letra de una palabra. Si usa la orden «ex para desplazarse hasta el final de una palabra, Vim adivina que quiere incluir el último carácter:

source: To err is human. a computer. ~
es_es: Errar es humano. ordenador. ~

source: Whether the character under the cursor is included depends on the command you used to move to that character. The reference manual calls this "exclusive" when the character isn't included and "inclusive" when it is.
es_es: El que el carácter bajo el cursor se incluya o no depende de la orden de movimiento empleado. El manual de referencia llama a esto «exclusivo» cuando el carácter no se incluye e «inclusivo» en caso contrario.

source: The "$" command moves to the end of a line. The "d$" command deletes from the cursor to the end of the line. This is an inclusive motion, thus the last character of the line is included in the delete operation:
es_es: La orden «$» le desplaza hasta el final de la línea. La orden «d$» elimina desde el cursor hasta el final de la línea. Este es un movimiento inclusivo, por lo que el último carácter de la línea se incluye en la operación:

source: To err is human. a computer. ~ ------------> d$
es_es: Errar es humano. ordenador. ~ -----------> d$

source: To err is human ~
es_es: Errar es humano ~

source: There is a pattern here: operator-motion. You first type an operator command. For example, "d" is the delete operator. Then you type a motion command like "4l" or "w". This way you can operate on any text you can move over.
es_es: Esto sigue siempre la misma estructura: operador-movimiento. Primero introduce el operador. Por ejemplo, «d» es el operador de eliminación. Luego introduce una orden de movimiento «4l» o «w». De esta manera, puede operar sobre cualquier texto en el que se pueda desplazar.

source: *04.2* Changing text
es_es: *04.2* Cambiar texto

source: Another operator is "c", change. It acts just like the "d" operator, except it leaves you in Insert mode. For example, "cw" changes a word. Or more specifically, it deletes a word and then puts you in Insert mode.
es_es: Otro operador es «c», cambiar (change). Actúa justo como el operador «d», excepto que le deja en modo Insertar. Por ejemplo «cw» cambia una palabra. Es decir, elimina una palabra y le deja en modo Insertar.

source: To err is human ~ -------> c2wbe<Esc>
es_es: Errar es humano ~ ---------> c2wEl ser<Esc>

source: To be human ~
es_es: El ser humano ~

source: c the change operator 2w move two words (they are deleted and Insert mode started) be insert this text <Esc> back to Normal mode
es_es: c el operador de cambio 2w moverse dos palabras (se eliminan y va al modo Insertar) El ser inserta el siguiente texto <Esc> de vuelta al modo Normal

source: If you have paid attention, you will have noticed something strange: The space before "human" isn't deleted. There is a saying that for every problem there is an answer that is simple, clear, and wrong. That is the case with the example used here for the "cw" command. The c operator works just like the d operator, with one exception: "cw". It actually works like "ce", change to end of word. Thus the space after the word isn't included. This is an exception that dates back to the old Vi. Since many people are used to it now, the inconsistency has remained in Vim.
es_es: Si ha prestado atención, se habrá dado cuenta de que hay algo raro: El espacio antes de «humano» no se ha eliminado. Hay un dicho: para cada problema hay una solución que es simple, clara y errónea. Este es el caso con el ejemplo usado aquí con la orden «cw». El operador «c» funciona justo como el operador «d», con una excepción: «cw». De hecho, funciona justo igual que «ce», cambiar hasta el final de la palabra. El espacio después de la palabra no se incluye. Esta excepción data de Vi. Ya que mucha gente se ha acostumbrado a ella, ha permanecido con Vim.

source: Like "dd" deletes a whole line, "cc" changes a whole line. It keeps the existing indent (leading white space) though.
es_es: Del mismo modo que «dd» elimina una línea completa, «cc» la cambia. Además, mantiene la sangría (los espacios en blanco precedentes).

source: Just like "d$" deletes until the end of the line, "c$" changes until the end of the line. It's like doing "d$" to delete the text and then "a" to start Insert mode and append new text.
es_es: Así como «d$» elimina hasta el final de la línea, «c$» la cambia hasta el final. Es como pulsar «d$» para eliminar el texto y luego «a» para activar el modo Insertar y añadir más texto.
